app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["sex", "F"], ["updated_at", "2022-07-01 21:09:06.408547"], ["id", 1]]